<template>
  <div id="app">
    <router-view/>
  </div>
</template>

<script>
import 'normalize.css'
export default {
  created () {
    if (!localStorage.getItem('hiragana')) {
      localStorage.setItem('hiragana', JSON.stringify([
        ['あ', 'a'], ['い', 'i'], ['う', 'u'], ['え', 'e'], ['お', 'o'],
        ['か', 'ka'], ['き', 'ki'], ['く', 'ku'], ['け', 'ke'], ['こ', 'ko'],
        ['さ', 'sa'], ['し', 'shi'], ['す', 'su'], ['せ', 'se'], ['そ', 'so'],
        ['た', 'ta'], ['ち', 'chi'], ['つ', 'tsu'], ['て', 'te'], ['と', 'to'],
        ['な', 'na'], ['に', 'ni'], ['ぬ', 'nu'], ['ね', 'ne'], ['の', 'no'],
        ['は', 'ha'], ['ひ', 'hi'], ['ふ', 'fu'], ['へ', 'he'], ['ほ', 'ho'],
        ['ま', 'ma'], ['み', 'mi'], ['む', 'mu'], ['め', 'me'], ['も', 'mo'],
        ['や', 'ya'], ['ゆ', 'yu'], ['よ', 'yo'],
        ['ら', 'ra'], ['り', 'ri'], ['る', 'ru'], ['れ', 're'], ['ろ', 'ro'],
        ['わ', 'wa'], ['を', 'wo'], ['ん', 'n']
      ]))
    }
    if (!localStorage.getItem('katakana')) {
      localStorage.setItem('katakana', JSON.stringify([
        ['ア', 'a'], ['イ', 'i'], ['ウ', 'u'], ['エ', 'e'], ['オ', 'o'],
        ['カ', 'ka'], ['キ', 'ki'], ['ク', 'ku'], ['ケ', 'ke'], ['コ', 'ko'],
        ['サ', 'sa'], ['シ', 'shi'], ['ス', 'su'], ['セ', 'se'], ['ソ', 'so'],
        ['タ', 'ta'], ['チ', 'chi'], ['ツ', 'tsu'], ['テ', 'te'], ['ト', 'to'],
        ['ナ', 'na'], ['ニ', 'ni'], ['ヌ', 'nu'], ['ネ', 'ne'], ['ノ', 'no'],
        ['ハ', 'ha'], ['ヒ', 'hi'], ['フ', 'fu'], ['ヘ', 'he'], ['ホ', 'ho'],
        ['マ', 'ma'], ['ミ', 'mi'], ['ム', 'mu'], ['メ', 'me'], ['モ', 'mo'],
        ['ヤ', 'ya'], ['ユ', 'yu'], ['ヨ', 'yo'],
        ['ラ', 'ra'], ['リ', 'ri'], ['ル', 'ru'], ['レ', 're'], ['ロ', 'ro'],
        ['ワ', 'wa'], ['ヲ', 'wo'], ['ン', 'n']
      ]))
    }
    if (!localStorage.getItem('both')) {
      localStorage.setItem('both', JSON.stringify([
        ['あ', 'ア'], ['い', 'イ'], ['う', 'ウ'], ['え', 'エ'], ['お', 'オ'],
        ['か', 'カ'], ['き', 'キ'], ['く', 'ク'], ['け', 'ケ'], ['こ', 'コ'],
        ['さ', 'サ'], ['し', 'シ'], ['す', 'ス'], ['せ', 'セ'], ['そ', 'ソ'],
        ['た', 'タ'], ['ち', 'チ'], ['つ', 'ツ'], ['て', 'テ'], ['と', 'ト'],
        ['な', 'ナ'], ['に', 'ニ'], ['ぬ', 'ヌ'], ['ね', 'ネ'], ['の', 'ノ'],
        ['は', 'ハ'], ['ひ', 'ヒ'], ['ふ', 'フ'], ['へ', 'ヘ'], ['ほ', 'ホ'],
        ['ま', 'マ'], ['み', 'ミ'], ['む', 'ム'], ['め', 'メ'], ['も', 'モ'],
        ['や', 'ヤ'], ['ゆ', 'ユ'], ['よ', 'ヨ'],
        ['ら', 'ラ'], ['り', 'リ'], ['る', 'ル'], ['れ', 'レ'], ['ろ', 'ロ'],
        ['わ', 'ワ'], ['を', 'ヲ'], ['ん', 'ン']
      ]))
    }
  }
}
</script>

<style>
:root {
  --mainColor: #aa6da3;
  --titleColor: #f9f8f8;
  --subtitleColor: #bbb5bd;
  --textColor: #bbb5bd;
}
</style>
